App/CSMIS/EMC-Nick/EBT介接/Doc/EMC網工CM WebService/呼叫WebService的XML格式/CPIPReg.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <CPIPReg xmlns="http://tempuri.org/CMWebServiceGW/CMWebServiceGW">
      <WORKID>string</WORKID>
      <CUSSO>string</CUSSO>
      <CUSID>string</CUSID>
      <CMMAC>string</CMMAC>
      <EMTAMAC>string</EMTAMAC>
      <CPNO>string</CPNO>
      <Zone>string</Zone>
      <Lin>string</Lin>
      <Section>string</Section>
      <Lane>string</Lane>
      <Alley>string</Alley>
      <SubAlley>string</SubAlley>
      <NO1>string</NO1>
      <NO2>string</NO2>
      <OPERTYPE>string</OPERTYPE>
    </CPIPReg>
  </soap:Body>
</soap:Envelope>
